IDEA StatiCa Open Model
CssComponentLoading.Id Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Id of cross-section component
 Namespace: IdeaRS.OpenModel.Concrete.Load
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public int Id { get; set; }
Public Property Id As Integer
	Get
	Set
public:
property int Id {
	int get ();
	void set (int value);
}
Property Value
Type: Int32
See Also
Reference
CssComponentLoading Class
IdeaRS.OpenModel.Concrete.Load Namespace